[
  {
    "title": "catJAMMER - A Discord bot",
    "description": "A joint project written in Typescript. This Node application is made to provide additional functionality to chatrooms on the popular app Discord. Some of these features include the ability to save and use GIFS, choose what colour they appear as and schedule reoccuring messages.",
    "tags": ["Typescript", "Node", "Discord.js"],
    "link": "https://github.com/bluefinger/catjammer"
  },
  {
    "title": "ToDo - A React App",
    "description": "An example application made using React and Bootstrap. Allows user to add tasks that they intend to do, mark them as complete or remove them. Includes abilty to filter the tasks based on completion and time left from completion date. Bootstrap was used for the styling.",
    "tags": ["React", "Javascript", "Bootstrap"],
    "link": "https://github.com/stuart-payne/to-do"
  },
  {
    "title": "This Website - SSG made with Nuxt.js",
    "description": "Using Nuxt.js this site was made with the objective to get the best of both worlds from a frontend framework like Vue while still keeping load times and file size down thanks to the static site generation of Nuxt. The styling is vanilla CSS and added in the Vue files allowing for scoping.",
    "tags": [ "Nuxt.js", "Vue", "CSS", "HTML"],
    "link": "https://github.com/stuart-payne/portfolio"
  },
  {
    "title": "Mock Blog Site - A Laravel Site",
    "description": "Using the popular framework Laravel, this site provides the basic functionality that a modern blogging platform that users expect. These features include user login and authentication, ability to post blog entries and to post comments on any blog posted on the site",
    "tags": ["Laravel", "PHP", "Bootstrap"],
    "link": "https://github.com/stuart-payne/laravelblog"
  },
  {
    "title": "Zelda Clone - A Unity Game",
    "description": "Inspired by the iconic series made by Nintendo, this game looks to implement similar game mechancs as those seen in the 2D games. Animated sprites which allow the player to attack using a sword and defeat enemies who respond to the player. Also included are puzzles and a boss fight against a formidle magician.",
    "tags": ["Unity", "C#"],
    "link": "https://github.com/stuart-payne/zelda-clone"
  }
]
